//   Зробити свій розпорядок дня.

//   У вас має бути більше 10 асинхронних дій з рандомними затримками.
//   Вам необхідно синхронізувати всі свої дії за допомогою промісів та async await (Код має бути написаний окремо)
//   Затримка має бути НЕ в порядку зростання, а будь яка. При тому ваші дії мають бути синхронізовані.

//   Напиклад:
// 1. Прокинутись - 0.4с
// 2. Поснідати - 0.3с
// 3. Піти в душ - 0.5с
// 4. Дочекатись автобус - 0.55с
// 5. Навчання в  октені - 3с
// 6. Пообідати - 0.7с
// 7. Виконання практичних завдань - 4с
// 8. Повернення додому - 1с
// 9. Піти в душ - 0.5с
// 10. Сон - 2с

function day0(){
    setTimeout(() =>{
        console.log('1.  Прокинутись');
        day1();
    }, 400)
}
function day1(){
    setTimeout(() =>{
        console.log('2.  Поснідати');
        day2();
    }, 300)
}
function day2(){
    setTimeout(() =>{
        console.log('3.  Піти в душ');
        day3();
    }, 500)
}
function day3(){
    setTimeout(() =>{
        console.log('4.  Дочекатись автобус');
        day4();
    }, 550)
}
function day4(){
    setTimeout(() =>{
        console.log('5.  Навчання в  октені');
        day5();
    }, 3000)
}
function day5(){
    setTimeout(() =>{
        console.log('6.  Пообідати');
        day6();
    }, 700)
}
function day6(){
    setTimeout(() =>{
        console.log('7.  Виконання практичних завдань');
        day7();
    }, 4000)
}
function day7(){
    setTimeout(() =>{
        console.log('8.  Повернення додому');
        day8();
    }, 1000)
}
function day8(){
    setTimeout(() =>{
        console.log('9.  Піти в душ');
        day9();
    }, 500)
}
function day9(){
    setTimeout(() =>{
        console.log('10. Сон');
    }, 2000)
}

day0();