// - створити функцію яка обчислює та повертає площу прямокутника висотою
function rectangle(a, b)
{
    return (a*b);
}

console.log(rectangle(10, 20));

// - створити функцію яка обчислює та повертає площу кола
let pi=3.14159;

function circle(r) {
    return (pi*r**2);
}

console.log(circle(10));

// - створити функцію яка обчислює та повертає площу циліндру
function cylinder(r, h)
{
    return (2*pi*r*h);
}
console.log(cylinder(2, 4));

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
function chysla(){

}


// - створити функцію яка при створює блок з текстом. Текст задати через аргумент

// - створити функцію яка при створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// - створити функцію яка при створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список


// const funPlus = (array) => {
//     let i = 0;
//     for (const arrayElement of array) {
//         i += arrayElement;
//     }
//     return i/array.length;
// };
// console.log(funPlus(1, 2, 3, 4));